{
  "Do not admit containers wishing to share the host process ID namespace": "Containers Should Not Share Host Process ID Namespace",
  "Containers should not share the host process ID namespace": "Containers Should Not Share Host Process ID Namespace",
  "Do not admit containers wishing to share the host IPC namespace": "Containers Should Not Share Host IPC Namespace",
  "Containers should not share the host IPC namespace": "Containers Should Not Share Host IPC Namespace",
  "Do not admit containers wishing to share the host network namespace": "Containers Should Not Share the Host Network Namespace",
  "Containers should not share the host network namespace": "Containers Should Not Share the Host Network Namespace",
  "Containers should not run with allowPrivilegeEscalation": "Containers Should Not Run with AllowPrivilegeEscalation",
  "Do not admit privileged containers": "Minimize the admission of privileged containers",
  "Container should not be privileged": "Minimize the admission of privileged containers",
  "Do not admit root containers": "Minimize Admission of Root Containers",
  "Minimize the admission of root containers": "Minimize Admission of Root Containers",
  "Do not admit containers with the NET_RAW capability": "Minimize the admission of containers with the NET_RAW capability",
  "Minimize the admission of containers with the NET_RAW capability": "Minimize the admission of containers with the NET_RAW capability",
  "Liveness Probe Should be Configured": "No liveness probe will ensure there is no recovery in case of unexpected errors",
  "Readiness Probe Should be Configured": "No readiness probe will affect automatic recovery in case of unexpected errors",
  "CPU requests should be set": "CPU Request Not Set in config file.",
  "CPU limits should be set": "CPU Limits Not Set in config file.",
  "Memory requests should be set": "Memory Request Not Set in config file.",
  "Memory limits should be set": "Memory Limits Not Set in config file.",
  "Image Tag should be fixed - not latest or blank": "No tag or container image with :Latest tag makes difficult to rollback and track",
  "The default namespace should not be used": "Default Namespace Should Not be Used",
  "Use read-only filesystem for containers where possible": "Container images with readOnlyRootFileSystem set as false mounts the container root file system with write permissions",
  "Do not expose the docker daemon socket to containers": "Restrict Mounting Docker Socket in a Container",
  "Apply security context to your pods and containers": "Apply Security Context to Your Pods and Containers",
  "Apply security context to your containers": "Apply Security Context to Your Pods and Containers",
  "Ensure that the seccomp profile is set to docker/default or runtime/default": "Default seccomp profile not enabled will make the container to make non-essential system calls",
  "Ensure default seccomp profile set to docker/default or runtime/default": "Default seccomp profile not enabled will make the container to make non-essential system calls",
  "Ensure the Kubernetes dashboard is not deployed": "Ensure Kubernetes Dashboard Is Not Deployed",
  "Ensure that Tiller (Helm v2) is not deployed": "Ensure That Tiller (Helm V2) Is Not Deployed",
  "Prefer using secrets as files over secrets as environment variables": "Prefer using secrets as files over secrets as environment variables",
  "Ensure that Service Account Tokens are only mounted where necessary": "Ensure that Service Account Tokens are only mounted where necessary",
  "Do not use the CAP_SYS_ADMIN linux capability": "Do Not Use CAP_SYS_ADMIN Linux Capability",
  "Containers should run as a high UID to avoid host conflict": "Containers Should Run as a High UID to Avoid Host Conflict",
  "Ensure that default service accounts are not actively used": "Ensure that default service accounts are not actively used in Kubernetes Role",
  "Image should use digest": "Image without digest affects the integrity principle of image security",
  "Ensure that the Tiller Service (Helm v2) is deleted": "Ensure that the Tiller Service (Helm v2) is deleted",
  "Ensure the Tiller Deployment (Helm V2) is not accessible from within the cluster": "Ensure That Tiller (Helm V2) Is Not Deployed",
  "Ensure that the admission control plugin AlwaysPullImages is set": "AlwaysPullImages plugin is not set",
  "Prevent All NGINX Ingress annotation snippets. See CVE-2021-25742": "CVE-2021-25742: Ingress-nginx with custom snippets allows retrieval of ingress-nginx serviceaccount token and secrets across all namespaces.",
  "Prevent NGINX Ingress annotation snippets which contain LUA code execution. See CVE-2021-25742": "CVE-2021-25742: Ingress-nginx with custom snippets allows retrieval of ingress-nginx serviceaccount token and secrets across all namespaces.",
  "Prevent NGINX Ingress annotation snippets which contain alias statements See CVE-2021-25742": "CVE-2021-25742: Ingress-nginx with custom snippets allows retrieval of ingress-nginx serviceaccount token and secrets across all namespaces."
}